In [ ]:
from datasets import load_dataset
import pandas as pd
import matplotlib.pyplot as plt

#load data
dataSet = load_dataset('lukebarousse/data_jobs')
df = dataSet['train'].to_pandas()


#clean data
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\Booheymen\AppData\Local\Programs\Python\Python312\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

## Use loc method than iloc why ?
Both .loc and .iloc methods in pandas are used to access a group of rows and columns from a DataFrame, but they serve different purposes and have different use cases:

.loc (Label-Based Indexing):
Label-Based: The .loc method is primarily label-based, meaning you can access rows and columns by their labels (names).
Inclusive: When specifying slices, both the start and the end labels are included.
Boolean Arrays: You can use boolean arrays for selecting rows.

.iloc (Integer-Based Indexing):
Integer-Based: The .iloc method is purely integer-location based, meaning you use row and column numbers to access elements.

Exclusive: When specifying slices, the end position is exclusive.

Positional Access: It's useful for accessing data by positions rather than labels.

In [ ]:
#use loc method than iloc

#use iloc
# Selecting rows by index position and specific columns
df.iloc[0:5, [0, 1]]

        job_title_short                                          job_title
0  Senior Data Engineer  Senior Clinical Data Engineer / Principal Clin...
1          Data Analyst                                       Data Analyst
2         Data Engineer  Data Engineer/Scientist/Analyst, Mid or Senior...
3         Data Engineer  LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...
4         Data Engineer                             Data Engineer- Sr Jobs

In [ ]:

#use iloc
# Selecting rows by index position and specific columns
df.iloc[0:5, [0, 1]]

In [12]:
df.loc[:,'salary_rate':'salary_hour_avg'].dropna(subset='salary_rate')

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]